[{"term": "redundancy", "definition": "when the same fact is stored multiple times in several places in a database", "next_review": "2023-01-25T16:35:17.456776"}, {"term": "controlled redundancy", "definition": "The DBMS ensures multiple copies of the same data are consistent (EX: if a new record w/ StudentNum=8 is stored in the database, the DBMS ensures StudentName=Smith in that record. ", "next_review": "2023-01-25T16:38:01.004895"}, {"term": "uncontrolled redundancy", "definition": "When the DBMS DOES NOT ensure that multiple copies of the same data are consistent. EX: if a new record w/ studentNum = 8, is added and the student associatedd with it's StudentNAme = Smith, if the name listed in the new record was not SMmith, this would be an uncontrolled redundancy", "next_review": "2023-01-25T16:39:16.501912"}, {"term": "How to see relationships between records of a database?", "definition": "Look at all the attributes and/or table headers, they will list all the recordds its related to", "next_review": "2023-01-25T16:48:15.412869"}, {"term": "query", "definition": "a request to the database Ex: give me the course# for Discrete Math", "next_review": "2023-01-25T16:48:52.515349"}, {"term": "update", "definition": "a change to the data in the database Ex: add a new student (list all attributes needed to make a new sstudent, name, course num, etc)", "next_review": "2023-01-25T16:49:23.648889"}, {"term": "Integrity constraint", "definition": "protocols a table's data columns must follow EX: student identification #s must be unique (key constraint), EX: A course id # listed in a section record must ACTUALLY exist in some course record", "next_review": "2023-01-25T17:00:53.272128"}, {"term": "give some systems for which it makes sense to use a traditional file processing instead of database", "definition": "ex: Small single user application that doesn't need security (personal addresss), Small single user application that doesn't require much storage (very little data) Like a calculator. Small internal utility to locate files, ", "next_review": "2023-01-25T17:14:52.894479"}, {"term": "end user", "definition": "people whose jobs require access to a database for querying, updating, and generating reports", "next_review": "2023-01-25T19:47:27.863703"}, {"term": "application user", "definition": "someone who accesses an existing application program to perform daily tasks", "next_review": "2023-01-25T19:47:46.646361"}, {"term": "sophisticated user", "definition": "those who have their own way of accessing the database. They do not use the application program provided by the system. they define their own or describe there needs w/ query languages", "next_review": "2023-01-25T19:48:53.172826"}]